# Selecting Subsets of Data from DataFrames with just the brackets

## Selecting Subsets of Data
One of the most common tasks during a data analysis is to select a subset of the dataset. In pandas, this means selecting particular rows and/or columns from a DataFrame or Series. Although subset selection sounds like an easy task, and is an easy task for many other data manipulation tools, it's actually quite complex with pandas.

### Examples of Selections of Subsets of Data
The following images show different types of subset selection that are possible. We will first highlight the values we want to select and then show the corresponding DataFrame after the completed selection.

### Selection of columns

The most common subset selection, involves selecting one or more of the columns of a DataFrame. In this example, we select the `color`, `age`, and `height` columns.

![][2]

Resulting DataFrame:

![][3]

### Selection of rows

Subsets of rows are a less frequent selection. In this example, we select the rows labeled `Aaron` and `Dean`.

![][4]

Resulting DataFrame:

![][5]

### Simultaneous selection of rows and columns

The last type of subset selection involves selecting rows and columns simultaneously. In this example, we select the `color`, `age`, and `height` columns along with the rows labeled `Aaron` and `Dean`.

![][6]

Resulting DataFrame:

![][7]

[1]: images/sample_df.png
[2]: images/just_cols.png
[3]: images/just_cols2.png
[4]: images/just_rows.png
[5]: images/just_rows2.png
[6]: images/rows_cols.png
[7]: images/rows_cols2.png

## pandas dual references: by label and by integer location
As previously mentioned, the index of each DataFrame provides a label to reference each individual row. Similarly, the column names provide a label to reference each column. What hasn't been mentioned, is that each row and column may be referenced by an integer as well. I call this **integer location**. The integer location begins at 0 for the first row and continues sequentially one integer at a time until the last row. The last row will have integer location `n - 1`, where `n` is the total number of rows in the DataFrame. 

Take a look above at our sample DataFrame one more time. The rows with labels `Aaron` and `Dean` can also be referenced by their respective integer locations 2 and 4. Similarly, the columns `color`, `age`, and `height` can be referenced by their integer locations 1, 3, and 4.

The official pandas documentation refers to integer location as **position**. I don't particularly like this terminology as it's not as explicit as integer location. The key term here is **integers**.

### What's the difference between indexing and selecting subsets of data?
The documentation uses the term **indexing** frequently. This term means is a shorter, more technical term that implies **subset selection**. I prefer the term subset selection as, again, it is more descriptive of what is actually happening. Indexing is also the term used in the official Python documentation (for selecting subsets of lists or strings for example).

## The three indexers `[ ]`, `loc`, `iloc`

pandas provides three **indexers** to select subsets of data. An indexer is a term for one of  `[ ]`, `loc`, or `iloc` and what makes the subset selection. All the details on how to make selections with each of these indexers will be covered. Each indexer has different rules for how it works. All of our selections will look similar to the following, except they will have something placed within the brackets.

```
>>> df[]
>>> df.loc[]
>>> df.iloc[]
```

### Terminology
When the brackets are placed directly after the DataFrame, the term **just the brackets** will be used to differentiate them from the brackets after `loc` and `iloc`.

### Square brackets instead of parentheses
One of the most common mistakes when using `loc` and `iloc` is to append parentheses to them, instead of square brackets. One of the main reasons this mistake is done is because `loc` and `iloc` appear to be methods and all methods are called with parentheses. Both `loc` and `iloc` are not methods, but are accessed in the same manner as methods through the dot notation, which leads to the mistake.

Few objects accessed through the dot notation will use brackets instead of parentheses. It helps to know that the brackets are a universal operator for selecting subsets of data regardless of the type of object. The brackets select subsets of lists, strings, and select a single value in a dictionary. numpy arrays use the brackets operator for subset selection. So, if you are doing subset selection, it's likely that the object uses brackets and not parentheses.

## Begin with *just the brackets*
As we saw in a previous chapter, just the brackets are used to select a single column as a Series. We place the column name inside the brackets to return the Series. Let's read in a simple, small DataFrame and select a single column.

In [27]:
import pandas as pd
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

Append square brackets directly to the name of the DataFrame and then place the name of the column within those brackets. A single column of data is selected as a Series.

In [28]:
df['color']

Jane          blue
Niko         green
Aaron          red
Penelope     white
Dean          gray
Christina    black
Cornelia       red
Name: color, dtype: object

## Select Multiple Columns with a List
You can select multiple columns by placing them in a list inside of just the brackets. Notice that a DataFrame and NOT a Series is returned.

In [29]:
df[['color', 'age', 'score']]

           color  age  score
Jane        blue   30    4.6
Niko       green    2    8.3
Aaron        red   12    9.0
Penelope   white    4    3.3
Dean        gray   32    1.8
Christina  black   33    9.5
Cornelia     red   69    2.2

### You must use an inner set of brackets
You might be tempted to do the following which will NOT work. When selecting multiple columns, you must use a **list** to contain the names. Remember that a list is defined by a set of square brackets, so the following will raise an error.

In [30]:
df[['color', 'age', 'score']]

           color  age  score
Jane        blue   30    4.6
Niko       green    2    8.3
Aaron        red   12    9.0
Penelope   white    4    3.3
Dean        gray   32    1.8
Christina  black   33    9.5
Cornelia     red   69    2.2

### Use two lines of code to select multiple columns
To help clarify the process of making subset selection, I recommend using intermediate variables. In this instance, we can assign the columns we would like to select to a list and then pass this list to the brackets.

In [31]:
cols = ['color', 'age', 'score']
df[cols]

           color  age  score
Jane        blue   30    4.6
Niko       green    2    8.3
Aaron        red   12    9.0
Penelope   white    4    3.3
Dean        gray   32    1.8
Christina  black   33    9.5
Cornelia     red   69    2.2

### Column order does not matter
You can create new DataFrames in any column order you wish. They do need not match the original column order.

In [32]:
cols = ['height', 'age']
df[cols]

           height  age
Jane          165   30
Niko           70    2
Aaron         120   12
Penelope       80    4
Dean          180   32
Christina     172   33
Cornelia      150   69

## Exercises
For the following exercises, make sure to use the movie dataset with `title` set as the index. It's good practice to shorten your output with the `head` method.

In [33]:
import pandas as pd
pd.set_option('display.max_columns', 30)
movies = pd.read_csv('../data/movie.csv', index_col='title')
movies.head(3)

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,actor3,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Avatar,2009.0,Color,PG-13,178.0,James Cameron,0.0,CCH Pounder,1000.0,Joel David Moore,936.0,Wes Studi,855.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,723.0,886204,avatar|future|marine|native|paraplegic,English,USA,237000000.0,7.9
Pirates of the Caribbean: At World's End,2007.0,Color,PG-13,169.0,Gore Verbinski,563.0,Johnny Depp,40000.0,Orlando Bloom,5000.0,Jack Davenport,1000.0,309404152.0,Action|Adventure|Fantasy,302.0,471220,goddess|marriage ceremony|marriage proposal|pi...,English,USA,300000000.0,7.1
Spectre,2015.0,Color,PG-13,148.0,Sam Mendes,0.0,Christoph Waltz,11000.0,Rory Kinnear,393.0,Stephanie Sigman,161.0,200074175.0,Action|Adventure|Thriller,602.0,275868,bomb|espionage|sequel|spy|terrorist,English,UK,245000000.0,6.8

### Exercise 1
<span  style="color:green; font-size:16px">Select the column with the director's name as a Series</span>

In [34]:
dir_names = movies['director_name']
dir_names.head(3)

title
Avatar                                       James Cameron
Pirates of the Caribbean: At World's End    Gore Verbinski
Spectre                                         Sam Mendes
Name: director_name, dtype: object

### Exercise 2
<span  style="color:green; font-size:16px">Select the column with the director's name and number of Facebook likes.</span>

In [35]:
cols = ['director_name', 'director_fb']
dir_name_fb = movies[cols]
dir_name_fb.head(3)

                                           director_name  director_fb
title
Avatar                                     James Cameron          0.0
Pirates of the Caribbean: At World's End  Gore Verbinski        563.0
Spectre                                       Sam Mendes          0.0

### Exercise 3
<span  style="color:green; font-size:16px">Select a single column as a DataFrame and not a Series</span>

In [36]:
cols = ['director_name']
movies[cols].head(3)

                                           director_name
title
Avatar                                     James Cameron
Pirates of the Caribbean: At World's End  Gore Verbinski
Spectre                                       Sam Mendes

### Exercise 4
<span  style="color:green; font-size:16px">Look in the data folder and read in another dataset. Select some columns from it.</span>

In [37]:
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df.head(3)

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [38]:
cols = ['age', 'height', 'score']
ahs = df[cols]
ahs.head(3)

       age  height  score
Jane    30     165    4.6
Niko     2      70    8.3
Aaron   12     120    9.0